
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

              Version Q-2019.12-SP5-5 for linux64 - Mar 21, 2021 

                    Copyright (c) 1988 - 2021 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.
Initializing...
if { [catch {



# ---------------------------------------
# DESIGN PROFILE
# ---------------------------------------
set topmodule_name      FIFO
set clk_port_name       clk
set clk_freq            1200
# ---------------------------------------
# Read Libraries
# ---------------------------------------
set LIBLIST_PATH        $env(LIBLIST_PATH)
source $LIBLIST_PATH

# ---------------------------------------
# Read Source Codes
# ---------------------------------------
set RTL_PATH            $env(RTL_PATH)
read_file $RTL_PATH -autoread -recursive -format sverilog -top $topmodule_name

# ---------------------------------------
# 1. Environments Setting
# ---------------------------------------
link
uniquify

# ---------------------------------------
# 2. Constraints Setting
# ---------------------------------------
# Clock
# Reduce clock period to model wire delay (60% of original period)
set delay_percentage 0.6
set clk_period [expr 1000 / double($clk_freq)]
set clk_period [expr $clk_period * $delay_percentage]

if {[sizeof_collection [get_ports $clk_port_name]] > 0} {
  # Create real clock if clock port is found
  set clk_name $clk_port_name
  create_clock -period $clk_period -name $clk_name $clk_name
  # If real clock, set infinite drive strength
  set_drive 0 $clk_name
} elseif {[sizeof_collection [get_ports $clk_port_name]] == 0} {
  # Create virtual clock if clock port is not found
  set clk_name vclk
  create_clock -period $clk_period -name $clk_name $clk_name
}

# Apply default timing constraints for modules
set_input_delay  0.0 [all_inputs] -clock $clk_name
set_output_delay 0.0 [all_outputs] -clock $clk_name

# Transition time of a slope that drives the port,
# such that a higher transition value means longer delays
# This prevents the hold time violations that we don't have to care about
set_input_transition 0.1 [all_inputs]

# Area
# If max_area is set 0, DesignCompiler will minimize the design as small as possible
set_max_area 0 

# ---------------------------------------
# 3. Compilation
# ---------------------------------------
compile_ultra

# ---------------------------------------
# 4. Design Reports
# ---------------------------------------
check_design  > $topmodule_name.check_design.rpt

report_constraint -all_violators -verbose -sig 10 > $topmodule_name.all_viol.rpt

report_design > $topmodule_name.design.rpt
report_area -physical -hierarchy > $topmodule_name.area.rpt
report_cell > $topmodule_name.cell.rpt
report_qor > $topmodule_name.qor.rpt
report_reference > $topmodule_name.reference.rpt
report_resources > $topmodule_name.resources.rpt
report_hierarchy -full > $topmodule_name.hierarchy.rpt
report_timing -nworst 10 -max_paths 10 > $topmodule_name.timing.rpt
report_power -analysis_effort high > $topmodule_name.power.rpt
report_threshold_voltage_group > $topmodule_name.vth.rpt

# Dump out the constraints in an SDC file
write_sdc $topmodule_name.constraints.sdc

# Dump out the synthesized database and gate-level-netlist
write -hierarchy -format ddc -output      $topmodule_name.ddc
write -hierarchy -format verilog -output  $topmodule_name.netlist.v

exit



} err] } { exit 1 }
== READ_FILE autoread for top design 'FIFO' ==

Starting READ_FILE autoread mode...
Information: Adding '/home/lhm7198/DRAM_CACHE/rtl/'.  (AUTOREAD-100)
Warning: Adding missing directory to search_path - '/home/lhm7198/DRAM_CACHE/rtl/'. (AUTOREAD-105)
Information: Source fifo.v ignored by autoread due to filtering.  (AUTOREAD-102)
Information: Source filelist.f ignored by autoread due to filtering.  (AUTOREAD-102)
Information: Source ROB.v ignored by autoread due to filtering.  (AUTOREAD-102)
Error: No HDL source files found. (AUTOREAD-202)
*** Autoread command terminated with errors. ***

Memory usage for this session 53 Mbytes.
Memory usage for this session including child processes 53 Mbytes.
CPU usage for this session 2 seconds ( 0.00 hours ).
Elapsed time for this session 3 seconds ( 0.00 hours ).

Thank you...
