###################################################################

# Created by write_sdc on Mon Jul  4 11:46:28 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock [get_ports clk]  -period 0.5  -waveform {0 0.25}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  0  [get_ports write_en]
set_input_delay -clock clk  0  [get_ports {write_data[7]}]
set_input_delay -clock clk  0  [get_ports {write_data[6]}]
set_input_delay -clock clk  0  [get_ports {write_data[5]}]
set_input_delay -clock clk  0  [get_ports {write_data[4]}]
set_input_delay -clock clk  0  [get_ports {write_data[3]}]
set_input_delay -clock clk  0  [get_ports {write_data[2]}]
set_input_delay -clock clk  0  [get_ports {write_data[1]}]
set_input_delay -clock clk  0  [get_ports {write_data[0]}]
set_input_delay -clock clk  0  [get_ports read_en]
set_output_delay -clock clk  0  [get_ports full]
set_output_delay -clock clk  0  [get_ports A_full]
set_output_delay -clock clk  0  [get_ports empty]
set_output_delay -clock clk  0  [get_ports A_empty]
set_output_delay -clock clk  0  [get_ports {read_data[7]}]
set_output_delay -clock clk  0  [get_ports {read_data[6]}]
set_output_delay -clock clk  0  [get_ports {read_data[5]}]
set_output_delay -clock clk  0  [get_ports {read_data[4]}]
set_output_delay -clock clk  0  [get_ports {read_data[3]}]
set_output_delay -clock clk  0  [get_ports {read_data[2]}]
set_output_delay -clock clk  0  [get_ports {read_data[1]}]
set_output_delay -clock clk  0  [get_ports {read_data[0]}]
set_output_delay -clock clk  0  [get_ports {test[3]}]
set_output_delay -clock clk  0  [get_ports {test[2]}]
set_output_delay -clock clk  0  [get_ports {test[1]}]
set_output_delay -clock clk  0  [get_ports {test[0]}]
set_input_transition -max 0.1  [get_ports clk]
set_input_transition -min 0.1  [get_ports clk]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports write_en]
set_input_transition -min 0.1  [get_ports write_en]
set_input_transition -max 0.1  [get_ports {write_data[7]}]
set_input_transition -min 0.1  [get_ports {write_data[7]}]
set_input_transition -max 0.1  [get_ports {write_data[6]}]
set_input_transition -min 0.1  [get_ports {write_data[6]}]
set_input_transition -max 0.1  [get_ports {write_data[5]}]
set_input_transition -min 0.1  [get_ports {write_data[5]}]
set_input_transition -max 0.1  [get_ports {write_data[4]}]
set_input_transition -min 0.1  [get_ports {write_data[4]}]
set_input_transition -max 0.1  [get_ports {write_data[3]}]
set_input_transition -min 0.1  [get_ports {write_data[3]}]
set_input_transition -max 0.1  [get_ports {write_data[2]}]
set_input_transition -min 0.1  [get_ports {write_data[2]}]
set_input_transition -max 0.1  [get_ports {write_data[1]}]
set_input_transition -min 0.1  [get_ports {write_data[1]}]
set_input_transition -max 0.1  [get_ports {write_data[0]}]
set_input_transition -min 0.1  [get_ports {write_data[0]}]
set_input_transition -max 0.1  [get_ports read_en]
set_input_transition -min 0.1  [get_ports read_en]
